cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/services"

# System
brew "mas"
brew "duti"
brew "mc"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "curl"
brew "wget"
brew "k6"
brew "screen"

# Dev
brew "pyenv"
brew "pyenv-virtualenv"

# Apps
cask "1password"
cask "1password-cli"
cask "visual-studio-code"
cask "firefox"
cask "google-chrome"
cask "vlc"
cask "telegram"
cask "signal"
cask "iterm2"
cask "plex"
cask "slack"
cask "mullvadvpn"
cask "tailscale"
cask "anydesk"
cask "dropshare"
cask "forklift"
cask "docker"
cask "parallels"
cask "transmission"
cask "4k-video-downloaderplus"
cask "discord"
cask "postman"
cask "balenaetcher"

# Git
brew "git"
brew "git-lfs"

## IAC 
brew "ansible"
brew "terraform"

# Archive
brew "xz"
brew "p7zip"

# MAS
mas 'XCode', id: 497799835
